build/resources/main/ack.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ecom="http://www.moduslink.com/ECommerceService">
   <soapenv:Header/>
   <soapenv:Body>
      <ecom:ReceiveCustomMessage>
         <!--Optional:-->
         <ecom:xmlDocument>
		
<ACK>
	<CLIENT>RB</CLIENT>
	<CAMPAIGN>HYBRIS</CAMPAIGN>
	<PROGRAM>Web Sales</PROGRAM>
	<EVENT>DUREX</EVENT>
	<SourceRefID />
	<SWQUOTEID>57843081</SWQUOTEID>
	<ICEORDERID />
	<ICEINVOICEID>0702896265</ICEINVOICEID>
	<SWPONUMBER />
	<ICEORDERREF>RBDURUK-400087002</ICEORDERREF>
	<CUSTOMERNAME>Sebastian Baltruszwicz</CUSTOMERNAME>
	<ICECUSTOMERNO />
	<SWSTATUS>Quote On Hold</SWSTATUS>
	<STATUS_DATE_TIME>2016-12-15-10.41.51</STATUS_DATE_TIME>
	<ERRORS />
	<INTERACTION>
		<TYPE>Order-Entry</TYPE>
		<QUOTE>
			<SWDISCOUNT>0</SWDISCOUNT>
			<SWDATESENT>
				<DAY>15</DAY>
				<MONTH>12</MONTH>
				<YEAR>2016</YEAR>
				<HOUR24 />
				<MINUTE>40</MINUTE>
				<SECOND>40</SECOND>
				<TIMEZONE>UTC</TIMEZONE>
			</SWDATESENT>
			<SWTOTALPRICE>24.98</SWTOTALPRICE>
			<ICESPLIT />
			<ICEBACKORDER />
			<ICETOTALTAX>3.99</ICETOTALTAX>
			<ICETOTALSHIP />
			<ICETOTALSERVICE />
			<ICEORDERSITE />
			<ICEWANTEDDELIVERYDATE />
			<ICECURRENCYCODE>EUR</ICECURRENCYCODE>
			<ICECURRENCYSEQ />
			<ICESOLCENTER />
			<ICEDELTERM>DAP</ICEDELTERM>
			<ICESHIPCOURIER />
			<ICEPRINTPRICE />
			<ICEPAYTERM>Tokenized</ICEPAYTERM>
			<ICEPRINTDELNOTE />
			<ICERUSHREASON />
			<ICERUSHTYPE />
			<ICEFREIGHTACCOUNT />
			<ICETOTALAMOUNT>24.98</ICETOTALAMOUNT>
			<ICESHIPSERVICE>10</ICESHIPSERVICE>
			<ICERUSH />
			<ICEORDERREF>RBSCHDE-00000003</ICEORDERREF>
			<ICEPLANNEDDELIVERYDATE />
			<ICERECEIVEDDELIVERYDATE />
			<ICEPRIORITY />
			<NOTES />
			<PAYMENT_INFO>
				<SWPONUMBER />
				<SWPAYMENTMETHOD>Credit Card</SWPAYMENTMETHOD>
				<SWTERMS />
				<SWCCTYPE>VISA</SWCCTYPE>
				<SWCCNUMBER />
				<KEYVER>3</KEYVER>
				<SWCCHOLDER>sebastian baltruszewicz</SWCCHOLDER>
				<SWCCEXPDATE>
					<DAY>1</DAY>
					<MONTH>1</MONTH>
					<YEAR>2017</YEAR>
					<HOUR24 />
					<MINUTE>0</MINUTE>
					<SECOND>0</SECOND>
					<TIMEZONE>UTC</TIMEZONE>
				</SWCCEXPDATE>
				<CC_CVC_CODE />
				<SWCCAUTHNUMBER>99999</SWCCAUTHNUMBER>
				<SWAMOUNT>24.98</SWAMOUNT>
				<SWBILLINGFREQUENCY />
				<SWNOTE />
				<ICECHECKNUM />
				<CC_TRANS_ID>8a82944a58f83eff015901dad60a692b</CC_TRANS_ID>
				<CC_INVOICE_ID />
				<ICEAUTHEXPDATE>
					<DAY>21</DAY>
					<MONTH>12</MONTH>
					<YEAR>2016</YEAR>
					<HOUR24 />
					<MINUTE>40</MINUTE>
					<SECOND>40</SECOND>
					<TIMEZONE>UTC</TIMEZONE>
				</ICEAUTHEXPDATE>
				<ICEPREPAID />
				<SWDCISSUENUM />
				<SWDCVALIDFROM />
			</PAYMENT_INFO>
			<HDYNAMIC_FIELDS>
				<HDYNAMIC_FIELD>
					<NAME>CountryCode</NAME>
					<VALUE>DE</VALUE>
				</HDYNAMIC_FIELD>
				<HDYNAMIC_FIELD>
					<NAME>LanguageCode</NAME>
					<VALUE>de</VALUE>
				</HDYNAMIC_FIELD>
				<HDYNAMIC_FIELD>
					<NAME>TRANSACTION_CHANNEL</NAME>
					<VALUE>8a82941847d450020147d4cf924c0153</VALUE>
				</HDYNAMIC_FIELD>
			</HDYNAMIC_FIELDS>
			<PERSONS>
				<PERSON>
					<TYPE>Ship To</TYPE>
					<SWFIRSTNAME>Sebastian</SWFIRSTNAME>
					<SWMIDDLENAME />
					<SWLASTNAME>Baltruszwicz</SWLASTNAME>
					<SWSOCIALSECURITY />
					<SWOFFICEPHONE />
					<SWFAX />
					<SWHOMEPHONE>
						<NUMBER>222</NUMBER>
						<AREACODE>+498969931</AREACODE>
						<COUNTRYCODE />
						<EXTENSION />
					</SWHOMEPHONE>
					<SWALTPHONE />
					<SWDEPARTMENT />
					<SWEMAILADDRESS>rbtest916@gmail.com</SWEMAILADDRESS>
					<SWEXTEMAILADDRESS />
					<SWSALUTATION>NONE</SWSALUTATION>
					<SWTITLE />
					<SWJOBTITLE />
					<ICELANGUAGE>German</ICELANGUAGE>
					<ADDRESSES>
						<ADDRESS>
							<TYPE>Ship To</TYPE>
							<SWADDRESS1>Werner-Heisenberg-Allee 25</SWADDRESS1>
							<SWADDRESS2 />
							<SWADDRESS3 />
							<SWADDRESS4 />
							<SWADDRESS5 />
							<SWCITY>München</SWCITY>
							<SWCOUNTY />
							<SWCOUNTRY>DE</SWCOUNTRY>
							<SWPROVINCE />
							<SWMAILSTOP />
							<SWNOTE />
							<SWPOBOX />
							<SWSTATE />
							<SWZIP>80939</SWZIP>
							<SWDEFAULT />
							<SWSTREETNUM />
						</ADDRESS>
					</ADDRESSES>
				</PERSON>
				<PERSON>
					<TYPE>Bill To</TYPE>
					<SWFIRSTNAME>Sebastian</SWFIRSTNAME>
					<SWMIDDLENAME />
					<SWLASTNAME>Baltruszwicz</SWLASTNAME>
					<SWSOCIALSECURITY />
					<SWOFFICEPHONE />
					<SWFAX />
					<SWHOMEPHONE />
					<SWALTPHONE />
					<SWDEPARTMENT />
					<SWEMAILADDRESS>rbtest916@gmail.com</SWEMAILADDRESS>
					<SWEXTEMAILADDRESS />
					<SWSALUTATION>NONE</SWSALUTATION>
					<SWTITLE />
					<SWJOBTITLE />
					<ICELANGUAGE>German</ICELANGUAGE>
					<ADDRESSES>
						<ADDRESS>
							<TYPE>Bill To</TYPE>
							<SWADDRESS1>Werner-Heisenberg-Allee 25</SWADDRESS1>
							<SWADDRESS2 />
							<SWADDRESS3 />
							<SWADDRESS4 />
							<SWADDRESS5 />
							<SWCITY>München</SWCITY>
							<SWCOUNTY />
							<SWCOUNTRY>DE</SWCOUNTRY>
							<SWPROVINCE />
							<SWMAILSTOP />
							<SWNOTE />
							<SWPOBOX />
							<SWSTATE />
							<SWZIP>80939</SWZIP>
							<SWDEFAULT />
							<SWSTREETNUM />
						</ADDRESS>
					</ADDRESSES>
				</PERSON>
			</PERSONS>
			<QUOTE_ITEMS>
				<QUOTE_ITEM>
					<SWPARTNUMBER>3025449</SWPARTNUMBER>
					<SWQUANTITY>1</SWQUANTITY>
					<SWDISCOUNT />
					<SWDESC>Scholl Warzenentferner Freeze 16 Sticks</SWDESC>
					<SWPRICE>15.96</SWPRICE>
					<SWCOST>18.99</SWCOST>
					<ICEQUOTELINENO>1</ICEQUOTELINENO>
					<ICELINENOTE />
					<ICEPRINTNOTE />
					<LDYNAMIC_FIELDS>
						<LDYNAMIC_FIELD>
							<NAME>ORIGINAL_GROSS_PRICE</NAME>
							<VALUE>18.99</VALUE>
						</LDYNAMIC_FIELD>
						<LDYNAMIC_FIELD>
							<NAME>VAT_FACTOR</NAME>
							<VALUE>1.19</VALUE>
						</LDYNAMIC_FIELD>
					</LDYNAMIC_FIELDS>
					<ICEVATCODE />
				</QUOTE_ITEM>
				<QUOTE_ITEM>
					<SWPARTNUMBER>RB_SHIPCOSTS</SWPARTNUMBER>
					<SWQUANTITY>1</SWQUANTITY>
					<SWDISCOUNT />
					<SWDESC>RB_SHIPCOSTS</SWDESC>
					<SWPRICE>5.03</SWPRICE>
					<SWCOST>5.99</SWCOST>
					<ICEQUOTELINENO>2</ICEQUOTELINENO>
					<ICELINENOTE />
					<ICEPRINTNOTE />
					<LDYNAMIC_FIELDS>
						<LDYNAMIC_FIELD>
							<NAME>ORIGINAL_GROSS_PRICE</NAME>
							<VALUE>5.99</VALUE>
						</LDYNAMIC_FIELD>
						<LDYNAMIC_FIELD>
							<NAME>VAT_FACTOR</NAME>
							<VALUE>1.19</VALUE>
						</LDYNAMIC_FIELD>
					</LDYNAMIC_FIELDS>
					<ICEVATCODE />
				</QUOTE_ITEM>
			</QUOTE_ITEMS>
			<ICE_CLIENT_ID>1783634</ICE_CLIENT_ID>
			<SW_CAMPAIGN_ID>786</SW_CAMPAIGN_ID>
			<SW_PROGRAM_ID>1266</SW_PROGRAM_ID>
			<SW_EVENT_ID>4832</SW_EVENT_ID>
			<SWCREATEDBY>BizTalk</SWCREATEDBY>
			<ICESESSIONID>10152024</ICESESSIONID>
			<ICEINTERACTIONID>9984069</ICEINTERACTIONID>
			<EXTERNALREF>RBDURUK-400087002</EXTERNALREF>
		</QUOTE>
	</INTERACTION>
	<Procedure>
		<Name />
		<Action>DO</Action>
		<Synchronous>FALSE</Synchronous>
	</Procedure>
	<OutMessageID>28216762</OutMessageID>
	<Receiver>RBDUR</Receiver>
	<ExternalRef>RBDURUK-400087002</ExternalRef>
	<GlobalRef>RBDURUK-400087002</GlobalRef>
	<MsgOrigin />
	<MsgTrackingId />
	<Origin>APELVICT</Origin>
	<OriginId>28216762</OriginId>
</ACK>
     </ecom:xmlDocument>
      </ecom:ReceiveCustomMessage>
   </soapenv:Body>
</soapenv:Envelope>